In [1]:
import pandas as pd

In [2]:
big_mac = pd.read_csv("bigmac.csv", parse_dates = ["Date"], date_format = "%Y-%m-%d", index_col = ["Date", "Country"]).sort_index()
big_mac.head()

                      Price in US Dollars
Date       Country
2000-04-01 Argentina             2.500000
           Australia             1.541667
           Brazil                1.648045
           Britain               3.002000
           Canada                1.938776

In [3]:
# big_mac.set_index(keys = ["Date", "Country"])
# big_mac.set_index(keys = ["Country", "Date"]).sort_index()

big_mac.index.names
big_mac.index[0]

(Timestamp('2000-04-01 00:00:00'), 'Argentina')

In [4]:
big_mac.index.get_level_values("Date")
big_mac.index.get_level_values(0)

big_mac.index.get_level_values("Country")
big_mac.index.get_level_values(1)

Index(['Argentina', 'Australia', 'Brazil', 'Britain', 'Canada', 'Chile',
       'China', 'Czech Republic', 'Denmark', 'Euro area',
       ...
       'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'Turkey', 'Ukraine',
       'United Arab Emirates', 'United States', 'Uruguay', 'Vietnam'],
      dtype='object', name='Country', length=1386)

In [5]:
big_mac.index.set_names(names = "Time", level = 0)
big_mac.index.set_names(names = "Location", level = 1)
big_mac.index.set_names(names = ["Time", "Location"])

big_mac.index = big_mac.index.set_names(names = ["Time", "Location"])

In [6]:
big_mac.sort_index()
big_mac.sort_index(ascending = True)
big_mac.sort_index(ascending = False)

big_mac.sort_index(ascending = [True, False])
big_mac.sort_index(ascending = [False, True])

                          Price in US Dollars
Time       Location
2020-07-01 Argentina                 3.509232
           Australia                 4.578450
           Azerbaijan                2.324897
           Bahrain                   3.713035
           Brazil                    3.913528
...                                       ...
2000-04-01 Sweden                    2.714932
           Switzerland               3.470588
           Taiwan                    2.287582
           Thailand                  1.447368
           United States             2.510000

[1386 rows x 1 columns]

In [7]:
big_mac.iloc[2]

Price in US Dollars    1.648045
Name: (2000-04-01 00:00:00, Brazil), dtype: float64

In [8]:
big_mac.loc["2000-04-01"]
big_mac.loc["2000-04-01", "Canada"]
big_mac.loc["2000-04-01", "Price in US Dollars"]

big_mac.loc[("2000-04-01", "Canada")]

start = ("2000-04-01", "Hungary")
end = ("2000-04-01", "Poland")
big_mac.loc[("2000-04-01", "Hungary"): ("2000-04-01", "Poland")]
big_mac.loc[start: end]

big_mac.loc[("2019-07-09", "Hungary"):]

big_mac.loc[("2012-01-01", "Brazil"): ("2013-07-01", "Turkey")]

big_mac.loc[("2012-01-01", "Brazil"): ("2013-07-01", "Turkey"), "Price in US Dollars"]

Time        Location
2012-01-01  Brazil         5.678670
            Britain        3.823395
            Canada         4.632940
            Chile          4.050983
            China          2.438445
                             ...
2013-07-01  Sweden         6.156874
            Switzerland    6.719041
            Taiwan         2.630834
            Thailand       2.845723
            Turkey         4.342384
Name: Price in US Dollars, Length: 160, dtype: float64

In [10]:
start = ("2018-01-01", "China")
end = ("2018-01-01", "Denmark")

big_mac.loc[start:end].transpose()

Time                2018-01-01
Location                 China  Colombia Costa Rica Czech Republic  Denmark
Price in US Dollars   3.171642  3.832468   4.027932       3.807779  4.93202

In [22]:
world_stats = pd.read_csv("worldstats.csv", index_col = ["year", "country"]).sort_index().stack()
world_stats.head()

year  country
1960  Afghanistan  Population    8.994793e+06
                   GDP           5.377778e+08
      Algeria      Population    1.112489e+07
                   GDP           2.723638e+09
      Australia    Population    1.027648e+07
dtype: float64

In [21]:
# world_stats.stack()
# world_stats.stack().to_frame()

                                        0
year country
1960 Afghanistan Population  8.994793e+06
                 GDP         5.377778e+08
     Algeria     Population  1.112489e+07
                 GDP         2.723638e+09
     Australia   Population  1.027648e+07
...                                   ...
2015 World       GDP         7.343364e+13
     Zambia      Population  1.621177e+07
                 GDP         2.120156e+10
     Zimbabwe    Population  1.560275e+07
                 GDP         1.389294e+10

[22422 rows x 1 columns]

In [34]:
world_stats.unstack()
world_stats.unstack().columns
world_stats.unstack().unstack().columns

world_stats.unstack(level = 0)
world_stats.unstack(level = 'year')
world_stats.unstack(level = 1)
world_stats.unstack(level = 'country')
world_stats.unstack(level = 2)

world_stats.unstack(level = -3)

world_stats.unstack([1, 0])
world_stats.unstack([0, 1])

year                1960                                            \
country      Afghanistan       Algeria     Australia       Austria
Population  8.994793e+06  1.112489e+07  1.027648e+07  7.047539e+06
GDP         5.377778e+08  2.723638e+09  1.856759e+10  6.592694e+09

year                                                                \
country     Bahamas, The    Bangladesh       Belgium        Belize
Population  1.095260e+05  4.820070e+07  9.153489e+06  9.206800e+04
GDP         1.698023e+08  4.274894e+09  1.165872e+10  2.807248e+07

year                                    ...           2015                \
country            Benin       Bermuda  ... United Kingdom United States
Population  2.431620e+06  4.440000e+04  ...   6.513823e+07  3.214188e+08
GDP         2.261956e+08  8.446665e+07  ...   2.848755e+12  1.794700e+13

year                                                                      \
country    Upper middle income       Uruguay    Uzbekistan       Vietnam
Population        2.550326e+09  3.431555e+06  3.129950e+07  9.170380e+07
GDP               1.973288e+13  5.344270e+10  6.673280e+10  1.935994e+11

year
country    West Bank and Gaza         World        Zambia      Zimbabwe
Population       4.422143e+06  7.346633e+09  1.621177e+07  1.560275e+07
GDP              1.267740e+10  7.343364e+13  2.120156e+10  1.389294e+10

[2 rows x 11211 columns]

In [38]:
salesmen = pd.read_csv("salesmen.csv")
salesmen.head()

       Date Salesman  Revenue
0  1/1/2025   Sharon     7172
1  1/2/2025   Sharon     6362
2  1/3/2025   Sharon     5982
3  1/4/2025   Sharon     7917
4  1/5/2025   Sharon     7837

In [39]:
salesmen.pivot(index = "Date", columns = "Salesman", values = "Revenue")

Salesman   Alexander  Dave  Oscar  Ronald  Sharon
Date
1/1/2025        4430  1864   5250    2639    7172
1/10/2025        301  7105   7663    8267    7543
1/11/2025       9489  6851   8888    1340    1053
1/12/2025       8719  7147   3092     279    4362
1/13/2025       2349  6160   6139    7540    6812
...              ...   ...    ...     ...     ...
9/5/2025        2439   211   7743    4252     992
9/6/2025        7585  7293   5072    1112     556
9/7/2025        6669  9774   5230    3608    6499
9/8/2025        3058  8194   7755    5762    9621
9/9/2025        6823  4733   5684    8922    1231

[365 rows x 5 columns]

In [41]:
quarters = pd.read_csv("quarters.csv")
quarters

    Salesman      Q1      Q2      Q3      Q4
0      Boris  602908  233879  354479   32704
1      Piers   43790  514863  297151  544493
2      Tommy  392668  113579  430882  247231
3     Travis  834663  266785  749238  570524
4      Cindy  580935  411379  110390  651572
5        Rob  656644   70803  375948  321388
6       Mike  486141  600753  742716  404995
7      Stacy  479662  742806  770712    2501
8  Alexandra  992673  879183   37945  293710

In [45]:
quarters.melt(id_vars = "Salesman", var_name = "Quarter", value_name = "Revenue")

     Salesman Quarter  Revenue
0       Boris      Q1   602908
1       Piers      Q1    43790
2       Tommy      Q1   392668
3      Travis      Q1   834663
4       Cindy      Q1   580935
5         Rob      Q1   656644
6        Mike      Q1   486141
7       Stacy      Q1   479662
8   Alexandra      Q1   992673
9       Boris      Q2   233879
10      Piers      Q2   514863
11      Tommy      Q2   113579
12     Travis      Q2   266785
13      Cindy      Q2   411379
14        Rob      Q2    70803
15       Mike      Q2   600753
16      Stacy      Q2   742806
17  Alexandra      Q2   879183
18      Boris      Q3   354479
19      Piers      Q3   297151
20      Tommy      Q3   430882
21     Travis      Q3   749238
22      Cindy      Q3   110390
23        Rob      Q3   375948
24       Mike      Q3   742716
25      Stacy      Q3   770712
26  Alexandra      Q3    37945
27      Boris      Q4    32704
28      Piers      Q4   544493
29      Tommy      Q4   247231
30     Travis      Q4   570524
31      Cindy      Q4   651572
32        Rob      Q4   321388
33       Mike      Q4   404995
34      Stacy      Q4     2501
35  Alexandra      Q4   293710

In [3]:
foods = pd.read_csv("foods.csv")
foods.head()

  First Name  Gender          City Frequency       Item  Spend
0      Wanda  Female      Stamford    Weekly     Burger  15.66
1       Eric    Male      Stamford     Daily    Chalupa  10.56
2    Charles    Male      New York     Never      Sushi  42.14
3       Anna  Female  Philadelphia      Once  Ice Cream  11.01
4    Deborah  Female  Philadelphia     Daily    Chalupa  23.49

In [17]:
foods.pivot_table(values = "Spend", index = "Gender")
foods.pivot_table(values = "Spend", index = "Gender", aggfunc = "mean")
foods.pivot_table(values = "Spend", index = "Gender", aggfunc = "sum")

foods.pivot_table(values = "Spend", index = "Item", aggfunc = "sum")

foods.pivot_table(values = "Spend", index = ["Gender", "Item"], aggfunc = "sum")

foods.pivot_table(values = "Spend", index = ["Gender", "Item"], columns = "City", aggfunc = "sum")

foods.pivot_table(values = "Spend", index = "Item", columns = ["Gender", "City"], aggfunc = "sum")

foods.pivot_table(values = "Spend", index = "Item", columns = ["Gender", "City"], aggfunc = "count")
foods.pivot_table(values = "Spend", index = "Item", columns = ["Gender", "City"], aggfunc = "max")
foods.pivot_table(values = "Spend", index = "Item", columns = ["Gender", "City"], aggfunc = "min")

Gender      Female                           Male
City      New York Philadelphia Stamford New York Philadelphia Stamford
Item
Burger        2.25         1.97     6.24     5.43         1.71     2.83
Burrito       1.02         1.04     1.18    15.90         8.58     3.64
Chalupa       1.96         9.35     9.09    11.61         1.94    10.56
Donut         3.15         2.13     1.68     1.49         1.26     6.63
Ice Cream    13.39         7.61     8.80    14.06         4.89     3.43
Sushi         2.52        11.68     8.20     3.28         2.01    32.15